Microchip-MPLAB-Harmony/csp/apps/systick/systick_periodic_timeout/firmware/src/packs/ATSAML10E16A_DFP/component/ccl.h
/**
 * \brief Component description for CCL
 *
 * © 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-05-31T10:20:47Z */
#ifndef _SAML10_CCL_COMPONENT_H_
#define _SAML10_CCL_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR CCL                                          */
/* ************************************************************************** */

/* -------- CCL_CTRL : (CCL Offset: 0x00) (R/W 8) Control -------- */
#define CCL_CTRL_RESETVALUE                 _U_(0x00)                                     /**<  (CCL_CTRL) Control  Reset Value */

#define CCL_CTRL_SWRST_Pos                    _U_(0)                                         /**< (CCL_CTRL) Software Reset Position */
#define CCL_CTRL_SWRST_Msk                    (_U_(0x1) << CCL_CTRL_SWRST_Pos)               /**< (CCL_CTRL) Software Reset Mask */
#define CCL_CTRL_ENABLE_Pos                   _U_(1)                                         /**< (CCL_CTRL) Enable Position */
#define CCL_CTRL_ENABLE_Msk                   (_U_(0x1) << CCL_CTRL_ENABLE_Pos)              /**< (CCL_CTRL) Enable Mask */
#define   CCL_CTRL_ENABLE_OFF_Val             _U_(0x0)                                       /**< (CCL_CTRL) The peripheral is disabled  */
#define   CCL_CTRL_ENABLE_ON_Val              _U_(0x1)                                       /**< (CCL_CTRL) The peripheral is enabled  */
#define CCL_CTRL_ENABLE_OFF                   (CCL_CTRL_ENABLE_OFF_Val << CCL_CTRL_ENABLE_Pos) /**< (CCL_CTRL) The peripheral is disabled Position  */
#define CCL_CTRL_ENABLE_ON                    (CCL_CTRL_ENABLE_ON_Val << CCL_CTRL_ENABLE_Pos) /**< (CCL_CTRL) The peripheral is enabled Position  */
#define CCL_CTRL_RUNSTDBY_Pos                 _U_(6)                                         /**< (CCL_CTRL) Run in Standby Position */
#define CCL_CTRL_RUNSTDBY_Msk                 (_U_(0x1) << CCL_CTRL_RUNSTDBY_Pos)            /**< (CCL_CTRL) Run in Standby Mask */
#define   CCL_CTRL_RUNSTDBY_OFF_Val           _U_(0x0)                                       /**< (CCL_CTRL) Generic clock is not required in standby sleep mode  */
#define   CCL_CTRL_RUNSTDBY_ON_Val            _U_(0x1)                                       /**< (CCL_CTRL) Generic clock is required in standby sleep mode  */
#define CCL_CTRL_RUNSTDBY_OFF                 (CCL_CTRL_RUNSTDBY_OFF_Val << CCL_CTRL_RUNSTDBY_Pos) /**< (CCL_CTRL) Generic clock is not required in standby sleep mode Position  */
#define CCL_CTRL_RUNSTDBY_ON                  (CCL_CTRL_RUNSTDBY_ON_Val << CCL_CTRL_RUNSTDBY_Pos) /**< (CCL_CTRL) Generic clock is required in standby sleep mode Position  */
#define CCL_CTRL_Msk                          _U_(0x43)                                      /**< (CCL_CTRL) Register Mask  */


/* -------- CCL_SEQCTRL0 : (CCL Offset: 0x04) (R/W 8) SEQ Control 0 -------- */
#define CCL_SEQCTRL0_RESETVALUE             _U_(0x00)                                     /**<  (CCL_SEQCTRL0) SEQ Control 0  Reset Value */

#define CCL_SEQCTRL0_SEQSEL_Pos               _U_(0)                                         /**< (CCL_SEQCTRL0) Sequential Selection 0 Position */
#define CCL_SEQCTRL0_SEQSEL_Msk               (_U_(0xF) << CCL_SEQCTRL0_SEQSEL_Pos)          /**< (CCL_SEQCTRL0) Sequential Selection 0 Mask */
#define CCL_SEQCTRL0_SEQSEL(value)            (CCL_SEQCTRL0_SEQSEL_Msk & ((value) << CCL_SEQCTRL0_SEQSEL_Pos))
#define   CCL_SEQCTRL0_SEQSEL_DISABLE_Val     _U_(0x0)                                       /**< (CCL_SEQCTRL0) Sequential logic is disabled  */
#define   CCL_SEQCTRL0_SEQSEL_DFF_Val         _U_(0x1)                                       /**< (CCL_SEQCTRL0) D flip flop  */
#define   CCL_SEQCTRL0_SEQSEL_JK_Val          _U_(0x2)                                       /**< (CCL_SEQCTRL0) JK flip flop  */
#define   CCL_SEQCTRL0_SEQSEL_LATCH_Val       _U_(0x3)                                       /**< (CCL_SEQCTRL0) D latch  */
#define   CCL_SEQCTRL0_SEQSEL_RS_Val          _U_(0x4)                                       /**< (CCL_SEQCTRL0) RS latch  */
#define CCL_SEQCTRL0_SEQSEL_DISABLE           (CCL_SEQCTRL0_SEQSEL_DISABLE_Val << CCL_SEQCTRL0_SEQSEL_Pos) /**< (CCL_SEQCTRL0) Sequential logic is disabled Position  */
#define CCL_SEQCTRL0_SEQSEL_DFF               (CCL_SEQCTRL0_SEQSEL_DFF_Val << CCL_SEQCTRL0_SEQSEL_Pos) /**< (CCL_SEQCTRL0) D flip flop Position  */
#define CCL_SEQCTRL0_SEQSEL_JK                (CCL_SEQCTRL0_SEQSEL_JK_Val << CCL_SEQCTRL0_SEQSEL_Pos) /**< (CCL_SEQCTRL0) JK flip flop Position  */
#define CCL_SEQCTRL0_SEQSEL_LATCH             (CCL_SEQCTRL0_SEQSEL_LATCH_Val << CCL_SEQCTRL0_SEQSEL_Pos) /**< (CCL_SEQCTRL0) D latch Position  */
#define CCL_SEQCTRL0_SEQSEL_RS                (CCL_SEQCTRL0_SEQSEL_RS_Val << CCL_SEQCTRL0_SEQSEL_Pos) /**< (CCL_SEQCTRL0) RS latch Position  */
#define CCL_SEQCTRL0_Msk                      _U_(0x0F)                                      /**< (CCL_SEQCTRL0) Register Mask  */


/* -------- CCL_LUTCTRL0 : (CCL Offset: 0x08) (R/W 32) LUT Control 0 -------- */
#define CCL_LUTCTRL0_RESETVALUE             _U_(0x00)                                     /**<  (CCL_LUTCTRL0) LUT Control 0  Reset Value */

