Microchip-MPLAB-Harmony/csp/apps/systick/systick_periodic_timeout/firmware/src/packs/ATSAML10E16A_DFP/component/ccl.h
#define CCL_LUTCTRL0_ENABLE_Pos               _U_(1)                                         /**< (CCL_LUTCTRL0) LUT Enable Position */
#define CCL_LUTCTRL0_ENABLE_Msk               (_U_(0x1) << CCL_LUTCTRL0_ENABLE_Pos)          /**< (CCL_LUTCTRL0) LUT Enable Mask */
#define   CCL_LUTCTRL0_ENABLE_DISABLE_Val     _U_(0x0)                                       /**< (CCL_LUTCTRL0) The LUT is disabled  */
#define   CCL_LUTCTRL0_ENABLE_ENABLE_Val      _U_(0x1)                                       /**< (CCL_LUTCTRL0) The LUT is enabled  */
#define CCL_LUTCTRL0_ENABLE_DISABLE           (CCL_LUTCTRL0_ENABLE_DISABLE_Val << CCL_LUTCTRL0_ENABLE_Pos) /**< (CCL_LUTCTRL0) The LUT is disabled Position  */
#define CCL_LUTCTRL0_ENABLE_ENABLE            (CCL_LUTCTRL0_ENABLE_ENABLE_Val << CCL_LUTCTRL0_ENABLE_Pos) /**< (CCL_LUTCTRL0) The LUT is enabled Position  */
#define CCL_LUTCTRL0_FILTSEL_Pos              _U_(4)                                         /**< (CCL_LUTCTRL0) Filter Selection Position */
#define CCL_LUTCTRL0_FILTSEL_Msk              (_U_(0x3) << CCL_LUTCTRL0_FILTSEL_Pos)         /**< (CCL_LUTCTRL0) Filter Selection Mask */
#define CCL_LUTCTRL0_FILTSEL(value)           (CCL_LUTCTRL0_FILTSEL_Msk & ((value) << CCL_LUTCTRL0_FILTSEL_Pos))
#define   CCL_LUTCTRL0_FILTSEL_DISABLE_Val    _U_(0x0)                                       /**< (CCL_LUTCTRL0) Filter disabled  */
#define   CCL_LUTCTRL0_FILTSEL_SYNCH_Val      _U_(0x1)                                       /**< (CCL_LUTCTRL0) Synchronizer enabled  */
#define   CCL_LUTCTRL0_FILTSEL_FILTER_Val     _U_(0x2)                                       /**< (CCL_LUTCTRL0) Filter enabled  */
#define CCL_LUTCTRL0_FILTSEL_DISABLE          (CCL_LUTCTRL0_FILTSEL_DISABLE_Val << CCL_LUTCTRL0_FILTSEL_Pos) /**< (CCL_LUTCTRL0) Filter disabled Position  */
#define CCL_LUTCTRL0_FILTSEL_SYNCH            (CCL_LUTCTRL0_FILTSEL_SYNCH_Val << CCL_LUTCTRL0_FILTSEL_Pos) /**< (CCL_LUTCTRL0) Synchronizer enabled Position  */
#define CCL_LUTCTRL0_FILTSEL_FILTER           (CCL_LUTCTRL0_FILTSEL_FILTER_Val << CCL_LUTCTRL0_FILTSEL_Pos) /**< (CCL_LUTCTRL0) Filter enabled Position  */
#define CCL_LUTCTRL0_EDGESEL_Pos              _U_(7)                                         /**< (CCL_LUTCTRL0) Edge Selection Position */
#define CCL_LUTCTRL0_EDGESEL_Msk              (_U_(0x1) << CCL_LUTCTRL0_EDGESEL_Pos)         /**< (CCL_LUTCTRL0) Edge Selection Mask */
#define   CCL_LUTCTRL0_EDGESEL_DISABLED_Val   _U_(0x0)                                       /**< (CCL_LUTCTRL0) Edge detector is disabled  */
#define   CCL_LUTCTRL0_EDGESEL_ENABLED_Val    _U_(0x1)                                       /**< (CCL_LUTCTRL0) Edge detector is enabled  */
#define CCL_LUTCTRL0_EDGESEL_DISABLED         (CCL_LUTCTRL0_EDGESEL_DISABLED_Val << CCL_LUTCTRL0_EDGESEL_Pos) /**< (CCL_LUTCTRL0) Edge detector is disabled Position  */
#define CCL_LUTCTRL0_EDGESEL_ENABLED          (CCL_LUTCTRL0_EDGESEL_ENABLED_Val << CCL_LUTCTRL0_EDGESEL_Pos) /**< (CCL_LUTCTRL0) Edge detector is enabled Position  */
#define CCL_LUTCTRL0_INSEL0_Pos               _U_(8)                                         /**< (CCL_LUTCTRL0) Input Selection 0 Position */
#define CCL_LUTCTRL0_INSEL0_Msk               (_U_(0xF) << CCL_LUTCTRL0_INSEL0_Pos)          /**< (CCL_LUTCTRL0) Input Selection 0 Mask */
#define CCL_LUTCTRL0_INSEL0(value)            (CCL_LUTCTRL0_INSEL0_Msk & ((value) << CCL_LUTCTRL0_INSEL0_Pos))
#define   CCL_LUTCTRL0_INSEL0_MASK_Val        _U_(0x0)                                       /**< (CCL_LUTCTRL0) Masked input  */
#define   CCL_LUTCTRL0_INSEL0_FEEDBACK_Val    _U_(0x1)                                       /**< (CCL_LUTCTRL0) Feedback input source  */
#define   CCL_LUTCTRL0_INSEL0_LINK_Val        _U_(0x2)                                       /**< (CCL_LUTCTRL0) Linked LUT input source  */
#define   CCL_LUTCTRL0_INSEL0_EVENT_Val       _U_(0x3)                                       /**< (CCL_LUTCTRL0) Event input source  */
#define   CCL_LUTCTRL0_INSEL0_IO_Val          _U_(0x4)                                       /**< (CCL_LUTCTRL0) I/O pin input source  */
#define   CCL_LUTCTRL0_INSEL0_AC_Val          _U_(0x5)                                       /**< (CCL_LUTCTRL0) AC input source  */
#define   CCL_LUTCTRL0_INSEL0_TC_Val          _U_(0x6)                                       /**< (CCL_LUTCTRL0) TC input source  */
#define   CCL_LUTCTRL0_INSEL0_ALTTC_Val       _U_(0x7)                                       /**< (CCL_LUTCTRL0) Alternate TC input source  */
#define   CCL_LUTCTRL0_INSEL0_SERCOM_Val      _U_(0x9)                                       /**< (CCL_LUTCTRL0) SERCOM input source  */
#define   CCL_LUTCTRL0_INSEL0_ASYNCEVENT_Val  _U_(0xB)                                       /**< (CCL_LUTCTRL0) Asynchronous event input source  */
#define CCL_LUTCTRL0_INSEL0_MASK              (CCL_LUTCTRL0_INSEL0_MASK_Val << CCL_LUTCTRL0_INSEL0_Pos) /**< (CCL_LUTCTRL0) Masked input Position  */
#define CCL_LUTCTRL0_INSEL0_FEEDBACK          (CCL_LUTCTRL0_INSEL0_FEEDBACK_Val << CCL_LUTCTRL0_INSEL0_Pos) /**< (CCL_LUTCTRL0) Feedback input source Position  */
#define CCL_LUTCTRL0_INSEL0_LINK              (CCL_LUTCTRL0_INSEL0_LINK_Val << CCL_LUTCTRL0_INSEL0_Pos) /**< (CCL_LUTCTRL0) Linked LUT input source Position  */
#define CCL_LUTCTRL0_INSEL0_EVENT             (CCL_LUTCTRL0_INSEL0_EVENT_Val << CCL_LUTCTRL0_INSEL0_Pos) /**< (CCL_LUTCTRL0) Event input source Position  */
#define CCL_LUTCTRL0_INSEL0_IO                (CCL_LUTCTRL0_INSEL0_IO_Val << CCL_LUTCTRL0_INSEL0_Pos) /**< (CCL_LUTCTRL0) I/O pin input source Position  */
#define CCL_LUTCTRL0_INSEL0_AC                (CCL_LUTCTRL0_INSEL0_AC_Val << CCL_LUTCTRL0_INSEL0_Pos) /**< (CCL_LUTCTRL0) AC input source Position  */
#define CCL_LUTCTRL0_INSEL0_TC                (CCL_LUTCTRL0_INSEL0_TC_Val << CCL_LUTCTRL0_INSEL0_Pos) /**< (CCL_LUTCTRL0) TC input source Position  */
#define CCL_LUTCTRL0_INSEL0_ALTTC             (CCL_LUTCTRL0_INSEL0_ALTTC_Val << CCL_LUTCTRL0_INSEL0_Pos) /**< (CCL_LUTCTRL0) Alternate TC input source Position  */
#define CCL_LUTCTRL0_INSEL0_SERCOM            (CCL_LUTCTRL0_INSEL0_SERCOM_Val << CCL_LUTCTRL0_INSEL0_Pos) /**< (CCL_LUTCTRL0) SERCOM input source Position  */
#define CCL_LUTCTRL0_INSEL0_ASYNCEVENT        (CCL_LUTCTRL0_INSEL0_ASYNCEVENT_Val << CCL_LUTCTRL0_INSEL0_Pos) /**< (CCL_LUTCTRL0) Asynchronous event input source Position  */
#define CCL_LUTCTRL0_INSEL1_Pos               _U_(12)                                        /**< (CCL_LUTCTRL0) Input Selection 1 Position */
#define CCL_LUTCTRL0_INSEL1_Msk               (_U_(0xF) << CCL_LUTCTRL0_INSEL1_Pos)          /**< (CCL_LUTCTRL0) Input Selection 1 Mask */
#define CCL_LUTCTRL0_INSEL1(value)            (CCL_LUTCTRL0_INSEL1_Msk & ((value) << CCL_LUTCTRL0_INSEL1_Pos))
#define   CCL_LUTCTRL0_INSEL1_MASK_Val        _U_(0x0)                                       /**< (CCL_LUTCTRL0) Masked input  */
#define   CCL_LUTCTRL0_INSEL1_FEEDBACK_Val    _U_(0x1)                                       /**< (CCL_LUTCTRL0) Feedback input source  */
#define   CCL_LUTCTRL0_INSEL1_LINK_Val        _U_(0x2)                                       /**< (CCL_LUTCTRL0) Linked LUT input source  */
#define   CCL_LUTCTRL0_INSEL1_EVENT_Val       _U_(0x3)                                       /**< (CCL_LUTCTRL0) Event input source  */
#define   CCL_LUTCTRL0_INSEL1_IO_Val          _U_(0x4)                                       /**< (CCL_LUTCTRL0) I/O pin input source  */
#define   CCL_LUTCTRL0_INSEL1_AC_Val          _U_(0x5)                                       /**< (CCL_LUTCTRL0) AC input source  */
#define   CCL_LUTCTRL0_INSEL1_TC_Val          _U_(0x6)                                       /**< (CCL_LUTCTRL0) TC input source  */
#define   CCL_LUTCTRL0_INSEL1_ALTTC_Val       _U_(0x7)                                       /**< (CCL_LUTCTRL0) Alternate TC input source  */
#define   CCL_LUTCTRL0_INSEL1_SERCOM_Val      _U_(0x9)                                       /**< (CCL_LUTCTRL0) SERCOM input source  */
#define   CCL_LUTCTRL0_INSEL1_ASYNCEVENT_Val  _U_(0xB)                                       /**< (CCL_LUTCTRL0) Asynchronous event input source  */
#define CCL_LUTCTRL0_INSEL1_MASK              (CCL_LUTCTRL0_INSEL1_MASK_Val << CCL_LUTCTRL0_INSEL1_Pos) /**< (CCL_LUTCTRL0) Masked input Position  */
#define CCL_LUTCTRL0_INSEL1_FEEDBACK          (CCL_LUTCTRL0_INSEL1_FEEDBACK_Val << CCL_LUTCTRL0_INSEL1_Pos) /**< (CCL_LUTCTRL0) Feedback input source Position  */
#define CCL_LUTCTRL0_INSEL1_LINK              (CCL_LUTCTRL0_INSEL1_LINK_Val << CCL_LUTCTRL0_INSEL1_Pos) /**< (CCL_LUTCTRL0) Linked LUT input source Position  */
#define CCL_LUTCTRL0_INSEL1_EVENT             (CCL_LUTCTRL0_INSEL1_EVENT_Val << CCL_LUTCTRL0_INSEL1_Pos) /**< (CCL_LUTCTRL0) Event input source Position  */
#define CCL_LUTCTRL0_INSEL1_IO                (CCL_LUTCTRL0_INSEL1_IO_Val << CCL_LUTCTRL0_INSEL1_Pos) /**< (CCL_LUTCTRL0) I/O pin input source Position  */
#define CCL_LUTCTRL0_INSEL1_AC                (CCL_LUTCTRL0_INSEL1_AC_Val << CCL_LUTCTRL0_INSEL1_Pos) /**< (CCL_LUTCTRL0) AC input source Position  */
#define CCL_LUTCTRL0_INSEL1_TC                (CCL_LUTCTRL0_INSEL1_TC_Val << CCL_LUTCTRL0_INSEL1_Pos) /**< (CCL_LUTCTRL0) TC input source Position  */
#define CCL_LUTCTRL0_INSEL1_ALTTC             (CCL_LUTCTRL0_INSEL1_ALTTC_Val << CCL_LUTCTRL0_INSEL1_Pos) /**< (CCL_LUTCTRL0) Alternate TC input source Position  */
#define CCL_LUTCTRL0_INSEL1_SERCOM            (CCL_LUTCTRL0_INSEL1_SERCOM_Val << CCL_LUTCTRL0_INSEL1_Pos) /**< (CCL_LUTCTRL0) SERCOM input source Position  */
#define CCL_LUTCTRL0_INSEL1_ASYNCEVENT        (CCL_LUTCTRL0_INSEL1_ASYNCEVENT_Val << CCL_LUTCTRL0_INSEL1_Pos) /**< (CCL_LUTCTRL0) Asynchronous event input source Position  */
#define CCL_LUTCTRL0_INSEL2_Pos               _U_(16)                                        /**< (CCL_LUTCTRL0) Input Selection 2 Position */
#define CCL_LUTCTRL0_INSEL2_Msk               (_U_(0xF) << CCL_LUTCTRL0_INSEL2_Pos)          /**< (CCL_LUTCTRL0) Input Selection 2 Mask */
#define CCL_LUTCTRL0_INSEL2(value)            (CCL_LUTCTRL0_INSEL2_Msk & ((value) << CCL_LUTCTRL0_INSEL2_Pos))
#define   CCL_LUTCTRL0_INSEL2_MASK_Val        _U_(0x0)                                       /**< (CCL_LUTCTRL0) Masked input  */
#define   CCL_LUTCTRL0_INSEL2_FEEDBACK_Val    _U_(0x1)                                       /**< (CCL_LUTCTRL0) Feedback input source  */
#define   CCL_LUTCTRL0_INSEL2_LINK_Val        _U_(0x2)                                       /**< (CCL_LUTCTRL0) Linked LUT input source  */
#define   CCL_LUTCTRL0_INSEL2_EVENT_Val       _U_(0x3)                                       /**< (CCL_LUTCTRL0) Event input source  */
#define   CCL_LUTCTRL0_INSEL2_IO_Val          _U_(0x4)                                       /**< (CCL_LUTCTRL0) I/O pin input source  */
#define   CCL_LUTCTRL0_INSEL2_AC_Val          _U_(0x5)                                       /**< (CCL_LUTCTRL0) AC input source  */
#define   CCL_LUTCTRL0_INSEL2_TC_Val          _U_(0x6)                                       /**< (CCL_LUTCTRL0) TC input source  */
#define   CCL_LUTCTRL0_INSEL2_ALTTC_Val       _U_(0x7)                                       /**< (CCL_LUTCTRL0) Alternate TC input source  */
#define   CCL_LUTCTRL0_INSEL2_SERCOM_Val      _U_(0x9)                                       /**< (CCL_LUTCTRL0) SERCOM input source  */
#define   CCL_LUTCTRL0_INSEL2_ASYNCEVENT_Val  _U_(0xB)                                       /**< (CCL_LUTCTRL0) Asynchronous event input source  */
#define CCL_LUTCTRL0_INSEL2_MASK              (CCL_LUTCTRL0_INSEL2_MASK_Val << CCL_LUTCTRL0_INSEL2_Pos) /**< (CCL_LUTCTRL0) Masked input Position  */
#define CCL_LUTCTRL0_INSEL2_FEEDBACK          (CCL_LUTCTRL0_INSEL2_FEEDBACK_Val << CCL_LUTCTRL0_INSEL2_Pos) /**< (CCL_LUTCTRL0) Feedback input source Position  */
#define CCL_LUTCTRL0_INSEL2_LINK              (CCL_LUTCTRL0_INSEL2_LINK_Val << CCL_LUTCTRL0_INSEL2_Pos) /**< (CCL_LUTCTRL0) Linked LUT input source Position  */
#define CCL_LUTCTRL0_INSEL2_EVENT             (CCL_LUTCTRL0_INSEL2_EVENT_Val << CCL_LUTCTRL0_INSEL2_Pos) /**< (CCL_LUTCTRL0) Event input source Position  */
#define CCL_LUTCTRL0_INSEL2_IO                (CCL_LUTCTRL0_INSEL2_IO_Val << CCL_LUTCTRL0_INSEL2_Pos) /**< (CCL_LUTCTRL0) I/O pin input source Position  */
#define CCL_LUTCTRL0_INSEL2_AC                (CCL_LUTCTRL0_INSEL2_AC_Val << CCL_LUTCTRL0_INSEL2_Pos) /**< (CCL_LUTCTRL0) AC input source Position  */
#define CCL_LUTCTRL0_INSEL2_TC                (CCL_LUTCTRL0_INSEL2_TC_Val << CCL_LUTCTRL0_INSEL2_Pos) /**< (CCL_LUTCTRL0) TC input source Position  */
#define CCL_LUTCTRL0_INSEL2_ALTTC             (CCL_LUTCTRL0_INSEL2_ALTTC_Val << CCL_LUTCTRL0_INSEL2_Pos) /**< (CCL_LUTCTRL0) Alternate TC input source Position  */
#define CCL_LUTCTRL0_INSEL2_SERCOM            (CCL_LUTCTRL0_INSEL2_SERCOM_Val << CCL_LUTCTRL0_INSEL2_Pos) /**< (CCL_LUTCTRL0) SERCOM input source Position  */
#define CCL_LUTCTRL0_INSEL2_ASYNCEVENT        (CCL_LUTCTRL0_INSEL2_ASYNCEVENT_Val << CCL_LUTCTRL0_INSEL2_Pos) /**< (CCL_LUTCTRL0) Asynchronous event input source Position  */
#define CCL_LUTCTRL0_INVEI_Pos                _U_(20)                                        /**< (CCL_LUTCTRL0) Inverted Event Input Enable Position */
#define CCL_LUTCTRL0_INVEI_Msk                (_U_(0x1) << CCL_LUTCTRL0_INVEI_Pos)           /**< (CCL_LUTCTRL0) Inverted Event Input Enable Mask */
#define   CCL_LUTCTRL0_INVEI_NORMAL_Val       _U_(0x0)                                       /**< (CCL_LUTCTRL0) Incoming event is not inverted  */
#define   CCL_LUTCTRL0_INVEI_INVERTED_Val     _U_(0x1)                                       /**< (CCL_LUTCTRL0) Incoming event is inverted  */
#define CCL_LUTCTRL0_INVEI_NORMAL             (CCL_LUTCTRL0_INVEI_NORMAL_Val << CCL_LUTCTRL0_INVEI_Pos) /**< (CCL_LUTCTRL0) Incoming event is not inverted Position  */
#define CCL_LUTCTRL0_INVEI_INVERTED           (CCL_LUTCTRL0_INVEI_INVERTED_Val << CCL_LUTCTRL0_INVEI_Pos) /**< (CCL_LUTCTRL0) Incoming event is inverted Position  */
#define CCL_LUTCTRL0_LUTEI_Pos                _U_(21)                                        /**< (CCL_LUTCTRL0) LUT Event Input Enable Position */
#define CCL_LUTCTRL0_LUTEI_Msk                (_U_(0x1) << CCL_LUTCTRL0_LUTEI_Pos)           /**< (CCL_LUTCTRL0) LUT Event Input Enable Mask */
#define   CCL_LUTCTRL0_LUTEI_DISABLE_Val      _U_(0x0)                                       /**< (CCL_LUTCTRL0) LUT incoming event is disabled  */
#define   CCL_LUTCTRL0_LUTEI_ENABLE_Val       _U_(0x1)                                       /**< (CCL_LUTCTRL0) LUT incoming event is enabled  */
#define CCL_LUTCTRL0_LUTEI_DISABLE            (CCL_LUTCTRL0_LUTEI_DISABLE_Val << CCL_LUTCTRL0_LUTEI_Pos) /**< (CCL_LUTCTRL0) LUT incoming event is disabled Position  */
#define CCL_LUTCTRL0_LUTEI_ENABLE             (CCL_LUTCTRL0_LUTEI_ENABLE_Val << CCL_LUTCTRL0_LUTEI_Pos) /**< (CCL_LUTCTRL0) LUT incoming event is enabled Position  */
#define CCL_LUTCTRL0_LUTEO_Pos                _U_(22)                                        /**< (CCL_LUTCTRL0) LUT Event Output Enable Position */
#define CCL_LUTCTRL0_LUTEO_Msk                (_U_(0x1) << CCL_LUTCTRL0_LUTEO_Pos)           /**< (CCL_LUTCTRL0) LUT Event Output Enable Mask */
#define   CCL_LUTCTRL0_LUTEO_DISABLE_Val      _U_(0x0)                                       /**< (CCL_LUTCTRL0) LUT event output is disabled  */
#define   CCL_LUTCTRL0_LUTEO_ENABLE_Val       _U_(0x1)                                       /**< (CCL_LUTCTRL0) LUT event output is enabled  */
#define CCL_LUTCTRL0_LUTEO_DISABLE            (CCL_LUTCTRL0_LUTEO_DISABLE_Val << CCL_LUTCTRL0_LUTEO_Pos) /**< (CCL_LUTCTRL0) LUT event output is disabled Position  */
#define CCL_LUTCTRL0_LUTEO_ENABLE             (CCL_LUTCTRL0_LUTEO_ENABLE_Val << CCL_LUTCTRL0_LUTEO_Pos) /**< (CCL_LUTCTRL0) LUT event output is enabled Position  */
#define CCL_LUTCTRL0_TRUTH_Pos                _U_(24)                                        /**< (CCL_LUTCTRL0) Truth Value Position */
#define CCL_LUTCTRL0_TRUTH_Msk                (_U_(0xFF) << CCL_LUTCTRL0_TRUTH_Pos)          /**< (CCL_LUTCTRL0) Truth Value Mask */
#define CCL_LUTCTRL0_TRUTH(value)             (CCL_LUTCTRL0_TRUTH_Msk & ((value) << CCL_LUTCTRL0_TRUTH_Pos))
#define CCL_LUTCTRL0_Msk                      _U_(0xFF7FFFB2)                                /**< (CCL_LUTCTRL0) Register Mask  */


